dumbell_geo_short_quarter_re0.1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{

    inlet
    {
        type  fixedValue;
	    value uniform (1 0 0);	
    }

    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            noSlip;
    }

    interior_long
    {
        type symmetry;
    }

    interior_short
    {
        type symmetry;
    }
}


// ************************************************************************* //
