dumbell_geo_short_quarter_re0.1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-12;
        relTol          0.00001;
        nPreSweeps      0;
        nPostSweeps     0;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 8000;
        mergeLevels     4;
    }

    pFinal
    {
        $p;
        relTol      0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU
        tolerance       1e-12;
        relTol          0.00001;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;

    residualControl
    {
        p               1e-12;
        U               1e-12;
    }
}

relaxationFactors
{
    fields
    {
        p               0.4;
    }

    equations
    {
        U               0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
