dumbell_geo_short_quarter_re0.1/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

walls_feature
{
    surfaces
    (
        "dumbell_mesh.stl"
    );

    extractionMethod    extractFromSurface;
    includedAngle       150;
    geometricTestOnly   yes;
    intersectionMethod  none;
    writeObj            yes;
}

// ************************************************************************* //
