dumbell_geo_short_quarter_re0.1/Allrun
#!/bin/sh
cd ${0%/*} || exit 1 # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

#runApplication surfaceFeatures
#runApplication blockMesh
#runApplication decomposePar
#runParallel snappyHexMesh
#runApplication reconstructParMesh

runParallel simpleFoam
runApplication reconstructPar

#------------------------------------------------------------------------------
